comu/com.energyict.mdc.cim.webservices.inbound.soap/src/test/resources/samples/getenddeviceevents/GetEndDeviceEventsRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:get="http://iec.ch/TC57/2011/GetEndDeviceEventsMessage"
                  xmlns:mes="http://iec.ch/TC57/2011/schema/message"
                  xmlns:get1="http://iec.ch/TC57/2011/GetEndDeviceEvents#">
    <soapenv:Header/>
    <soapenv:Body>
        <get:GetEndDeviceEvents>
            <get:Header>
                <mes:Verb>get</mes:Verb>
                <mes:Noun>GetEndDeviceEvents</mes:Noun>
            </get:Header>
            <get:Request>
                <get1:GetEndDeviceEvents>
                    <get1:Meter>
                        <get1:Names>
                            <get1:name>SPE01000003</get1:name>
                        </get1:Names>
                    </get1:Meter>
                    <get1:Meter>
                        <get1:mRID>a13d9a4c-3de7-47f5-8e8d-9b50cf29f8a5</get1:mRID>
                    </get1:Meter>
                    <get1:TimeSchedule>
                        <get1:scheduleInterval>
                            <!--<get1:end>2017-10-31T00:00:00+00:00</get1:end>-->
                            <get1:start>2017-10-01T00:00:00+00:00</get1:start>
                        </get1:scheduleInterval>
                    </get1:TimeSchedule>
                </get1:GetEndDeviceEvents>
            </get:Request>
        </get:GetEndDeviceEvents>
    </soapenv:Body>
</soapenv:Envelope>